In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data=pd.read_excel('data/euro_dollar.xls',sheet_name='euro-dollar') # \s+ regex for 1 or more whitespaced

In [3]:
#data.info()

In [4]:
data5=data[['Unnamed: 24','Unnamed: 25','Unnamed: 26','Unnamed: 27','Unnamed: 28','Unnamed: 29','Unnamed: 30']]

In [5]:
data5.columns=data5.iloc[2]

In [6]:
data5=data5.drop([0,1,2],axis=0)

In [12]:
data5

2,Date,OPEN,HIGH,LOW,LAST_PRICE,NUMBER_TICKS,VOLUME
3,2009-12-09 23:05:00,1.473,1.4732,1.4729,1.473,591,0
4,2009-12-09 23:10:00,1.473,1.4735,1.473,1.4734,927,0
5,2009-12-09 23:15:00,1.4734,1.4737,1.4734,1.4736,1054,0
6,2009-12-09 23:20:00,1.4737,1.474,1.4735,1.4735,1026,0
7,2009-12-09 23:25:00,1.4735,1.4742,1.4735,1.4741,1231,0
...,...,...,...,...,...,...,...
41022,2010-06-24 16:50:00,1.2312,1.2315,1.2304,1.2307,3674,0
41023,2010-06-24 16:55:00,1.2307,1.2319,1.2305,1.2319,4014,0
41024,2010-06-24 17:00:00,1.2319,1.2319,1.2306,1.2311,4318,0
41025,2010-06-24 17:05:00,1.2311,1.2312,1.23,1.2308,4069,0
41026,2010-06-24 17:10:00,1.2308,1.2308,1.2307,1.2307,426,0

In [17]:
# convert Date column to pd.datetime
data5['Date']=pd.to_datetime(data5['Date'])

In [31]:
data5['Month']=data5['Date'].dt.month
data5['Day']=data5['Date'].dt.day
data5['Hour']=data5['Date'].dt.hour
data5['Min']=data5['Date'].dt.minute
data5['Weekday']=data5['Date'].dt.day_name()

In [32]:
data5

2,Date,OPEN,HIGH,LOW,LAST_PRICE,NUMBER_TICKS,VOLUME,Month,Day,Hour,Min,Weekday
3,2009-12-09 23:05:00,1.473,1.4732,1.4729,1.473,591,0,12,9,23,5,Wednesday
4,2009-12-09 23:10:00,1.473,1.4735,1.473,1.4734,927,0,12,9,23,10,Wednesday
5,2009-12-09 23:15:00,1.4734,1.4737,1.4734,1.4736,1054,0,12,9,23,15,Wednesday
6,2009-12-09 23:20:00,1.4737,1.474,1.4735,1.4735,1026,0,12,9,23,20,Wednesday
7,2009-12-09 23:25:00,1.4735,1.4742,1.4735,1.4741,1231,0,12,9,23,25,Wednesday
...,...,...,...,...,...,...,...,...,...,...,...,...
41022,2010-06-24 16:50:00,1.2312,1.2315,1.2304,1.2307,3674,0,6,24,16,50,Thursday
41023,2010-06-24 16:55:00,1.2307,1.2319,1.2305,1.2319,4014,0,6,24,16,55,Thursday
41024,2010-06-24 17:00:00,1.2319,1.2319,1.2306,1.2311,4318,0,6,24,17,0,Thursday
41025,2010-06-24 17:05:00,1.2311,1.2312,1.23,1.2308,4069,0,6,24,17,5,Thursday
41026,2010-06-24 17:10:00,1.2308,1.2308,1.2307,1.2307,426,0,6,24,17,10,Thursday

In [57]:
with open("data/Euro_dollar/Last/Prices/Euro_dollar5min.txt", "r") as file:
    data = str(file.read())

In [66]:
# split at each '\n' (new line)
input_data=data.split('\n')
# create numpy array (in order to change datatype to float)
input_data=np.array(input_data)
input_data=input_data.astype(np.float)
input_data=pd.DataFrame(input_data)

In [67]:
#create logs
log_data=np.log(input_data)

In [68]:
#create new column with lag_1 log_prices and delete first row
log_data['lag1']=log_data.shift()
log_data.drop(0,inplace=True)

In [76]:
#calculate log-returns
returns=log_data[0]-log_data['lag1']